### Address Books

##### This is an address book system, that shows the user the most popular book(s) searched in the database. It also enables the user to perform CRUD functionalities in the system.

#### Adding SQL Module

In [27]:
%reload_ext sql

#### Connecting python Programs to Postgres

In [28]:
from sqlalchemy import create_engine

#### Connecting to the AWS online database

In [29]:
%sql postgresql://gnsiobsurufrtp:0d57af453839e69ec694c32f5af9f06d938697b08d2c4e279403aa9eeed31661@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r

#### Creating a table in the database

In [30]:
%%sql

DROP TABLE  IF EXISTS Address_books_crit;

CREATE TABLE Address_books_crit
 (  
    ID int,
    Title varchar(255),
    Author varchar(255),
    ISBN VARCHAR(255),
    Publish_Date date,
    search_count int,
    price float,
    book_quantity int
    
    );

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
Done.
Done.

[]

#### Adding content to the table created in the database

In [31]:
%%sql
INSERT INTO Address_books_crit(ID, Title, Author, ISBN, Publish_Date,search_count,price,book_quantity)

VALUES(1,'Holding Up the Universe','Null','567-456-789-5','2002-07-05',0,123.90,1),
      (2,'A woman makes a plan', 'Maye Musk', '983-758-274-2', '2020-04-17',0,234.96,1),
      (3,'Mindset' ,'DR Carol S. Dweck','213-986-123-4','2017-01-10',0,456.80,1),
      (4, '7 habits of highly effective people','Steven R Covey','789-435-123-1' ,'2018-08-21',0,700.00,1),
      (5,'The leader who had no title','James Walsh','184-737-877-3','2010-04-01',0,345.76,1);

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[]

#### Verifyting the content in the table

In [32]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[(1, 'Holding Up the Universe', 'Null', '567-456-789-5', datetime.date(2002, 7, 5), 0, 123.9, 1),
 (2, 'A woman makes a plan', 'Maye Musk', '983-758-274-2', datetime.date(2020, 4, 17), 0, 234.96, 1),
 (3, 'Mindset', 'DR Carol S. Dweck', '213-986-123-4', datetime.date(2017, 1, 10), 0, 456.8, 1),
 (4, '7 habits of highly effective people', 'Steven R Covey', '789-435-123-1', datetime.date(2018, 8, 21), 0, 700.0, 1),
 (5, 'The leader who had no title', 'James Walsh', '184-737-877-3', datetime.date(2010, 4, 1), 0, 345.76, 1)]

#### Modifying the data in the table

In [34]:
%%sql

UPDATE Address_books_crit
SET author='Jennifer Niven'

WHERE id=1;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
1 rows affected.

[]

#### Verifying the created update

In [35]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[(2, 'A woman makes a plan', 'Maye Musk', '983-758-274-2', datetime.date(2020, 4, 17), 0, 234.96, 1),
 (3, 'Mindset', 'DR Carol S. Dweck', '213-986-123-4', datetime.date(2017, 1, 10), 0, 456.8, 1),
 (4, '7 habits of highly effective people', 'Steven R Covey', '789-435-123-1', datetime.date(2018, 8, 21), 0, 700.0, 1),
 (5, 'The leader who had no title', 'James Walsh', '184-737-877-3', datetime.date(2010, 4, 1), 0, 345.76, 1),
 (1, 'Holding Up the Universe', 'Jennifer Niven', '567-456-789-5', datetime.date(2002, 7, 5), 0, 123.9, 1)]

#### Deleting contents from the table

In [36]:
%%sql
DELETE FROM  Address_books_crit
WHERE Publish_Date='2017-01-10' ;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
1 rows affected.

[]

#### Verifying the created delete

In [37]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
4 rows affected.

[(2, 'A woman makes a plan', 'Maye Musk', '983-758-274-2', datetime.date(2020, 4, 17), 0, 234.96, 1),
 (4, '7 habits of highly effective people', 'Steven R Covey', '789-435-123-1', datetime.date(2018, 8, 21), 0, 700.0, 1),
 (5, 'The leader who had no title', 'James Walsh', '184-737-877-3', datetime.date(2010, 4, 1), 0, 345.76, 1),
 (1, 'Holding Up the Universe', 'Jennifer Niven', '567-456-789-5', datetime.date(2002, 7, 5), 0, 123.9, 1)]

#### Sorting the data in the table

In [38]:
%%sql


SELECT
	title,
	author
	
FROM Address_books_crit
	
ORDER BY
	title ASC,
	author ASC;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
4 rows affected.

[('7 habits of highly effective people', 'Steven R Covey'),
 ('A woman makes a plan', 'Maye Musk'),
 ('Holding Up the Universe', 'Jennifer Niven'),
 ('The leader who had no title', 'James Walsh')]

#### Verifying the sort

In [48]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
4 rows affected.

[(5, 'The leader who had no title', 'James Walsh', '184-737-877-3', datetime.date(2010, 4, 1), 0, 345.76, 1),
 (1, 'Holding Up the Universe', 'Jennifer Niven', '567-456-789-5', datetime.date(2002, 7, 5), 0, 123.9, 1),
 (2, 'A woman makes a plan', 'Maye Musk', '983-758-274-2', datetime.date(2020, 4, 17), 1, 234.96, 1),
 (4, '7 habits of highly effective people', 'Steven R Covey', '789-435-123-1', datetime.date(2018, 8, 21), 1, 700.0, 1)]

#### 1) Prompting the user to search desired book and author
#### 2) Updating the database based on previous search to find most popular search

In [47]:
book_search= input("Please enter the  book title you want to search: ")
author_search= input("Please enter the book author you want to search: ")
collected_author_data = %sql SELECT author  from  Address_books_crit
collected_book_data = %sql SELECT title  from  Address_books_crit

%sql UPDATE Address_books_crit SET search_count = search_count + 1 WHERE author = '{author_search}'

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
4 rows affected.
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
4 rows affected.
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
1 rows affected.

[]

#### Verifying the search counter on the database

In [42]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
4 rows affected.

[(2, 'A woman makes a plan', 'Maye Musk', '983-758-274-2', datetime.date(2020, 4, 17), 0, 234.96, 1),
 (4, '7 habits of highly effective people', 'Steven R Covey', '789-435-123-1', datetime.date(2018, 8, 21), 0, 700.0, 1),
 (5, 'The leader who had no title', 'James Walsh', '184-737-877-3', datetime.date(2010, 4, 1), 0, 345.76, 1),
 (1, 'Holding Up the Universe', 'Jennifer Niven', '567-456-789-5', datetime.date(2002, 7, 5), 0, 123.9, 1)]